user_tutorial/MTO_TF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       172040;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       172080;
    }
    Wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          880;
        startFace       172120;
    }
    right
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          560;
        startFace       173000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          172800;
        startFace       173560;
    }
)

// ************************************************************************* //
