user_tutorial/MTO_TF/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
//fluid
nu                           nu [0 2 -1 0 0 0 0] 1.0e-6;
alphaMax               alphaMax [0 0 -1 0 0 0 0] 2.5e3;
alphamax               alphamax [0 0 -1 0 0 0 0] 2.5e3;

// opt
raa0                   1e-5;
mma_init               0.3;
mma_dec                0.7;
mma_inc                1.2;
movlim                 0.4;
opt_converge           0.025;
opt_converge_smooth    0.8;    // Smooths (slows) convergence (max 1)

voluse                 0.4;
filter_Radius          2;
solid_area             0;
fluid_area             1;
test_PD                0;

D_normalization        1.57572e-07;
D0                     16;
D1                     10;
geo_dim                2;

b1                     b1 [0 2 -2 -2 0 0 0] 1;
qu                     0.005;


